src/test/resources/soap/weather-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:web="http://www.webserviceX.NET/">
  <soap:Body>
    <web:GetWeather>
      <web:CityName>New York</web:CityName>
      <web:CountryName>United States</web:CountryName>
    </web:GetWeather>
  </soap:Body>
</soap:Envelope>
